using ConsoleApp1;

// Задача 1: Задайте значения M и N. Напишите программу, которая выведет
// все натуральные числа в промежутке от M до N.
// Использовать рекурсию, не использовать циклы.
// Task1 task1 = new Task1();
// task1.RunTask();


// Задача 2: Напишите программу вычисления функции Аккермана с помощью рекурсии.
// Даны два неотрицательных числа m и n.
// Task2 task2 = new Task2();
// task2.RunTask();


// Задача 3: Задайте произвольный массив. Выведете его элементы, начиная с конца.
// Использовать рекурсию, не использовать циклы.
// Task3 task3 = new Task3();
// task3.RunTask();